<center><h1><strong>taudata Analytics</strong></h1></center>
<center><h2><strong><font color="blue">EDA 03 - Pengenalan DataFrame & Import-Loading Data</font></strong></h2></center>
<img alt="" src="images/covers/taudata-cover.jpg" alt="" width="800"/>

<b><center>(C) Taufik Sutanto</center>
<center><h3><font color="blue">https://taudata.blogspot.com/2022/05/eda-00.html</font></h3></center>
<center><h3><font color="blue">Video Penjelasan: https://www.youtube.com/c/taudataAnalytics</font></h3></center>

In [7]:
# Importing Some Python Modules
import warnings; warnings.simplefilter('ignore')
import matplotlib.pyplot as plt, pandas as pd, seaborn as sns
import numpy as np
"Done"

'Done'

# <center><font color="blue"> Pandas Dataframe</font></center>

<center><img alt="" src="images/pandas_dataframe_structure.jpg" style="height: 350px;" /></center>

* Pandas Dataframe dapat dibentuk dari **Dictionary** atau **List/Tuples**

In [8]:
# Dataframe dari Dictionary
D = {'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi', 'Budi'],
    'Age' : [23, 21, 22, 21, np.nan],
    'University' : ['BHU', 'JNU', 'DU', 'BHU', 'UI']} 
df = pd.DataFrame(D)
df

        Name   Age University
0      Ankit  23.0        BHU
1  Aishwarya  21.0        JNU
2    Shaurya  22.0         DU
3   Shivangi  21.0        BHU
4       Budi   NaN         UI

In [4]:
D

{'Name': ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
 'Age': [23, 21, 22, 21],
 'University': ['BHU', 'JNU', 'DU', 'BHU']}

In [21]:
# Dataframe dari List
Name = ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi']
Age = [23, 21, 22, 21]
University = ['BHU', 'JNU', 'DU', 'BHU'] 
df = pd.DataFrame(zip(Name, Age, University), columns=['Name', 'Age', 'University'])
df

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [18]:
Nama = ['iwan', 'wati']
Umur = [14, 9]
data = []
for i in range(2):
    data.append((Nama[i], Umur[i]))
data

[('iwan', 14), ('wati', 9)]

In [20]:
list(zip(Nama, Umur))

[('iwan', 14), ('wati', 9)]

In [17]:
pd.DataFrame(data, columns=['Nama', 'Umur'])

   Nama  Umur
0  iwan    14
1  wati     9

In [31]:
# # Slicing index bekerja seperti List, tapi harus hati-hati.
print(df.index)
df[3:4]

RangeIndex(start=0, stop=4, step=1)

       Name  Age University
3  Shivangi   21        BHU

In [28]:
L = [ 4, 7, 3, 2, 8]
L[0], L[1]
L[0:3]

[4, 7, 3]

# <center><font color="blue"> OK, Let's Start!: Import-Loading Data</font></center>

<center><img alt="" src="images/meme-cartoon/Reading-and-Writing-Data-With-Pandas.jpg" style="height: 300px;" /></center>

# <center><font color="blue"> Studi Kasus</font></center>

* Sumber Data: http://byebuyhome.com/
* Objective: menemukan harga rumah yang berada di bawah pasaran untuk melakukan investasi.
* Variable:
 - **Dist_Taxi** – distance to nearest taxi stand from the property
 - **Dist_Market** – distance to nearest grocery market from the property
 - **Dist_Hospital** – distance to nearest hospital from the property
 - **Carpet** – carpet area of the property in square feet
 - **Builtup** – built-up area of the property in square feet
 - **Parking** – type of car parking available with the property
 - **City_Category** – categorization of the city based on the size
 - **Rainfall** – annual rainfall in the area where property is located
 - **House_Price** – price at which the property was sold

<img alt="" src="images/property-investment-analysis.jpg" style="height: 250px;" />

# <center><font color="blue"> Import-Loading Data CSV / Excel Data via Pandas</font></center>

<img alt="" src="images/pandas load csv excel.png" style="height: 150px;" />

* Importing CSV file  https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
* Importing Excel file  https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html
* Encodings https://docs.python.org/3/library/codecs.html#standard-encodings

In [35]:
file_ = 'data/price.csv'
try: # Running Locally, yakinkan "file_" berada di folder "data"
    price = pd.read_csv(file_, low_memory = False, encoding='utf8')
except: # Running in Google Colab
    !mkdir data
    !wget -P data/ https://raw.githubusercontent.com/taudata-indonesia/eLearning/master/data/price.csv
    price = pd.read_csv(file_, low_memory = False, encoding='utf8')
    
N, P = price.shape # Ukuran Data
print('baris = ', N, ', Kolom (jumlah variabel) = ', P)
print("Tipe Variabe df = ", type(price))
price

baris =  936 , Kolom (jumlah variabel) =  10
Tipe Variabe df =  <class 'pandas.core.frame.DataFrame'>

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
0,1,9796.0,5250.0,10703.0,1659.0,1961.0,Open,CAT B,530,6649000
1,2,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000
2,3,11001.0,14399.0,16991.0,1340.0,1609.0,Not Provided,CAT A,720,5401000
3,4,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,CAT B,620,5373000
4,5,10510.0,12629.0,13921.0,1770.0,2111.0,Not Provided,CAT B,450,4662000
...,...,...,...,...,...,...,...,...,...,...
931,932,9297.0,12537.0,14418.0,1174.0,1429.0,Covered,CAT C,1110,5434000
932,933,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
933,934,9205.0,10418.0,14496.0,1118.0,1337.0,Open,CAT A,560,7227000
934,935,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
935,936,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000

In [39]:
price.sample(5)

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
175,176,5754.0,6031.0,9745.0,1465.0,1763.0,Not Provided,CAT A,680,9957000
700,701,5627.0,13099.0,10068.0,1461.0,1739.0,Covered,CAT C,1250,2231000
443,444,11031.0,12462.0,13010.0,1395.0,1662.0,Open,CAT A,920,9094000
829,830,7929.0,13867.0,14846.0,1349.0,1610.0,Open,CAT B,700,6589000
390,391,9689.0,10159.0,11554.0,1876.0,2254.0,No Parking,CAT C,1340,2165000

# <center><font color="blue"> Bagaimana dengan File Excel?</font></center>
## <font color="green"> Karena deprecated support, maka harus install module "openpyxl" terlebih dahulu</font>

* Importing Excel file  https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html
* openpyxl https://openpyxl.readthedocs.io/en/stable/
<center><img alt="" src="images/meme-cartoon/openpyxl.jpg" style="height: 300px;" /></center>

In [40]:
# Ingat module 02, jika anda menjalankan Jupyter notebook ini secara lokal, maka perlu penyesuaian
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\taufi\anaconda\envs\teaching\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\taufi\anaconda\envs\teaching\lib\site-packages (from openpyxl) (1.1.0)

In [42]:
file_ = 'data/price.xlsx'
try: # Running Locally 
    xl = pd.ExcelFile(file_, engine = 'openpyxl')
except: # Running in Google Colab
    !mkdir data
    !wget -P data/ https://raw.githubusercontent.com/taudata-indonesia/eLearning/master/{file_}
    xl = pd.ExcelFile(file_, engine = 'openpyxl')

sheets_ = xl.sheet_names
print(sheets_)
price = xl.parse(sheets_[0], header=0) #biasakan tidak menulis nama sheet secara langsung

N, P = price.shape # Ukuran Data
print('baris = ', N, ', Kolom (jumlah variabel) = ', P)
print("Tipe Variabe df = ", type(price))
price

['price1', 'price2']
baris =  936 , Kolom (jumlah variabel) =  10
Tipe Variabe df =  <class 'pandas.core.frame.DataFrame'>

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
0,1,9796.0,5250.0,10703.0,1659.0,1961.0,Open,CAT B,530,6649000
1,2,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000
2,3,11001.0,14399.0,16991.0,1340.0,1609.0,Not Provided,CAT A,720,5401000
3,4,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,CAT B,620,5373000
4,5,10510.0,12629.0,13921.0,1770.0,2111.0,Not Provided,CAT B,450,4662000
...,...,...,...,...,...,...,...,...,...,...
931,932,9297.0,12537.0,14418.0,1174.0,1429.0,Covered,CAT C,1110,5434000
932,933,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
933,934,9205.0,10418.0,14496.0,1118.0,1337.0,Open,CAT A,560,7227000
934,935,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
935,936,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000

In [43]:
sheets_

['price1', 'price2']

# <center><font color="blue"> Prefer XLS atau CSV di Data Science/Machine Learning/AI</font></center><br><font color="green">Mengapa?</font>

<center><img alt="" src="images/excel_error.png" style="height: 300px;" /></center>

In [ ]:
# "Mengintip" beberapa data pertamanya
price.head(7)

In [46]:
# Tips ... Gunakan Transpose untuk High-Dimensional Data (data dengan banyak kolom/variabel)
price.head().transpose()

                     0             1             2        3             4
Observation          1             2             3        4             5
Dist_Taxi       9796.0        8294.0       11001.0   8301.0       10510.0
Dist_Market     5250.0        8186.0       14399.0  11188.0       12629.0
Dist_Hospital  10703.0       12694.0       16991.0  12289.0       13921.0
Carpet          1659.0        1461.0        1340.0   1451.0        1770.0
Builtup         1961.0        1752.0        1609.0   1748.0        2111.0
Parking           Open  Not Provided  Not Provided  Covered  Not Provided
City_Category    CAT B         CAT B         CAT A    CAT B         CAT B
Rainfall           530           210           720      620           450
House_Price    6649000       3982000       5401000  5373000       4662000

In [ ]:
# "Mengintip" beberapa data akhirnya
price.tail(7)

In [47]:
# chosen at random
price.sample(10)

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
923,924,11786.0,13969.0,15519.0,1156.0,1398.0,Open,CAT A,140,9237000
560,561,6440.0,10689.0,13561.0,1381.0,1633.0,Not Provided,CAT C,1270,5025000
686,687,9420.0,13980.0,13290.0,1525.0,1839.0,No Parking,CAT B,540,5131000
149,150,7597.0,10595.0,9399.0,1214.0,1456.0,Not Provided,CAT B,530,4895000
644,645,8283.0,11709.0,15284.0,1426.0,1718.0,No Parking,CAT C,370,4757000
180,181,8391.0,12763.0,15332.0,1539.0,1837.0,Covered,CAT A,990,7847000
782,783,8618.0,10717.0,12286.0,1660.0,1979.0,Covered,CAT C,480,7580000
690,691,5059.0,7402.0,10629.0,1667.0,2020.0,Not Provided,CAT A,980,6607000
507,508,7678.0,14228.0,14778.0,1688.0,2046.0,Open,CAT B,380,5355000
773,774,8541.0,12045.0,14243.0,1534.0,1858.0,Open,CAT A,860,8837000

In [50]:
df2 = price.sample(100)
df2.head(9)

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
224,225,9024.0,9404.0,13234.0,1863.0,2245.0,Open,CAT A,640,7726000
457,458,12862.0,12087.0,17686.0,1744.0,2101.0,No Parking,CAT A,520,6957000
58,59,7331.0,11247.0,10787.0,1570.0,1898.0,No Parking,CAT B,980,6409000
598,599,2017.0,8473.0,9077.0,1511.0,1822.0,Open,CAT B,420,7241000
567,568,2314.0,8933.0,8231.0,1607.0,1909.0,Open,CAT C,460,3903000
204,205,10890.0,13235.0,13935.0,1652.0,1982.0,Covered,CAT C,690,5246000
748,749,7254.0,11059.0,14195.0,1430.0,1743.0,Open,CAT B,970,5323000
894,895,8320.0,11644.0,12967.0,1458.0,1757.0,Not Provided,CAT A,850,5860000
238,239,12631.0,12290.0,14599.0,1699.0,2053.0,Open,CAT A,1080,8187000

In [51]:
df2[1:3]

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
457,458,12862.0,12087.0,17686.0,1744.0,2101.0,No Parking,CAT A,520,6957000
58,59,7331.0,11247.0,10787.0,1570.0,1898.0,No Parking,CAT B,980,6409000

# <center><font color="blue">Perintah ".sample" bisa untuk sampling yang akan digunakan sebagai training data di machine Learning</font></center>

## <font color="green">Akan tetapi ada kelemahannya ... apakah?</font>

In [ ]:
df_train = price.sample(500)
df_train.head(10) # perhatikan kolom "index-nya"

# <center><font color="blue"> "loc" VS "iloc" in Pandas Dataframe</font></center>

<center><img alt="" src="images/dataframe loc iloc.png" style="height: 350px;" /></center>

In [60]:
# Ganti "N" dengan index pertama di df2
try:
    print(df2.loc[224]) 
except:
    print("Yakinkan nilai N adalah index pertama di df2")

Observation          225
Dist_Taxi         9024.0
Dist_Market       9404.0
Dist_Hospital    13234.0
Carpet            1863.0
Builtup           2245.0
Parking             Open
City_Category      CAT A
Rainfall             640
House_Price      7726000
Name: 224, dtype: object

In [59]:
df2.iloc[0]

Observation          225
Dist_Taxi         9024.0
Dist_Market       9404.0
Dist_Hospital    13234.0
Carpet            1863.0
Builtup           2245.0
Parking             Open
City_Category      CAT A
Rainfall             640
House_Price      7726000
Name: 224, dtype: object

# <center><font color="blue"> Iterating on dataframe (Sangat Penting)</font></center>
### <font color="green"> Banyak yang tidak menyarankan, tapi banyak situasi di dunia nyata yang memaksa kita melakukan hal ini.</font>

<center><img alt="" src="images/pandas iteration.png" style="height: 350px;" /></center>
    
* https://www.dataindependent.com/pandas/pandas-iterate-over-rows/

In [61]:
# Kita juga meng-iterasikan sebuah dataframe (jika diperlukan)
price['total_jarak'] = [0]*price.shape[0]
for i, d in price.iterrows():
    price['total_jarak'].loc[i] = d.Dist_Taxi + d.Dist_Market + d.Dist_Hospital

price.head().transpose()

                     0             1             2        3             4
Observation          1             2             3        4             5
Dist_Taxi       9796.0        8294.0       11001.0   8301.0       10510.0
Dist_Market     5250.0        8186.0       14399.0  11188.0       12629.0
Dist_Hospital  10703.0       12694.0       16991.0  12289.0       13921.0
Carpet          1659.0        1461.0        1340.0   1451.0        1770.0
Builtup         1961.0        1752.0        1609.0   1748.0        2111.0
Parking           Open  Not Provided  Not Provided  Covered  Not Provided
City_Category    CAT B         CAT B         CAT A    CAT B         CAT B
Rainfall           530           210           720      620           450
House_Price    6649000       3982000       5401000  5373000       4662000
total_jarak    25749.0       29174.0       42391.0  31778.0       37060.0

In [62]:
# Apply menggunakan "cython" sehingga lebih cepat
price['harga_jual'] = price['House_Price'].apply(lambda x: x + 250000)
# akan ada kolom baru di dataframe "price"
price.head(3)

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price,total_jarak,harga_jual
0,1,9796.0,5250.0,10703.0,1659.0,1961.0,Open,CAT B,530,6649000,25749.0,6899000
1,2,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000,29174.0,4232000
2,3,11001.0,14399.0,16991.0,1340.0,1609.0,Not Provided,CAT A,720,5401000,42391.0,5651000

# <center><font color="blue"> Removing variable(s) & Fixing Variable Type(s)</font></center>

<center><img alt="" src="images/pandas-dataframe-drop.png" style="height: 350px;" /></center>

In [64]:
# perhatikan perintahnya tidak menggunakan tanda "()" ==> Properties 
price.columns

Index(['Dist_Taxi', 'Dist_Market', 'Dist_Hospital', 'Carpet', 'Builtup',
       'Parking', 'City_Category', 'Rainfall', 'House_Price', 'total_jarak',
       'harga_jual'],
      dtype='object')

In [63]:
# Drop kolom pertama karena tidak berguna (hanya "observation" ~ index)
try: # Good practice untuk selalu gunakan Try-Except saat melakukan "drop" ... mengapa?
    price.drop(["Observation"], axis=1, inplace=True) # Parameter "inplace=True" penting saat datanya besar.
except Exception as err_:
    print(err_)
    
print(price.columns)
price.head(3)

Index(['Dist_Taxi', 'Dist_Market', 'Dist_Hospital', 'Carpet', 'Builtup',
       'Parking', 'City_Category', 'Rainfall', 'House_Price', 'total_jarak',
       'harga_jual'],
      dtype='object')

,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price,total_jarak,harga_jual
0,9796.0,5250.0,10703.0,1659.0,1961.0,Open,CAT B,530,6649000,25749.0,6899000
1,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000,29174.0,4232000
2,11001.0,14399.0,16991.0,1340.0,1609.0,Not Provided,CAT A,720,5401000,42391.0,5651000

In [66]:
# Contoh hapus baris ke-1 dan ke-3
price.drop(price.index[[0,2]], inplace=True) # sengaja tidak menggunakan "inplace=True" ... perhatikan hasil cell setelah ini

In [67]:
price.head(4) # Apa yang terjadi?

,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price,total_jarak,harga_jual
1,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000,29174.0,4232000
3,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,CAT B,620,5373000,31778.0,5623000
4,10510.0,12629.0,13921.0,1770.0,2111.0,Not Provided,CAT B,450,4662000,37060.0,4912000
5,6665.0,5142.0,9972.0,1442.0,1733.0,Open,CAT B,760,4526000,21779.0,4776000

In [ ]:
# di machine learning/AI/Data Science memahami Struktur Data adalah kunci penting untuk memahaminya
print( "type = ", type(price.index[[0,2]]),  "\nvalue = ",price.index[[0,2]]) 
# drop by int "index" kalau rows & nama column+axis=1 jika drop kolom

In [ ]:
# delete Rows dengan kondisi
price.drop(price[(price.House_Price > 6500000) & (price.House_Price < 9000000)].index, inplace=True)
# untuk mengingatnya, bayangkan saja "parameter" dari drop adalah int index seperti di penjelasan cell sebelumnya
print(price.shape)
price.head(7)

# <center><font color="blue"> Mengoreksi Tipe variabel: "dtype" & "info"</font></center>

### <font color="green"> Salah satu kunci penting dalam memahami ML/AI/Data Science baik Teori maupun aplikasinya adalah "Struktur Data"</font>
    
<center><img alt="" src="images/pandas_dtypes.png" style="height: 350px;" /></center>

In [68]:
# tipe data di setiap kolom
# Wajib di periksa apakah tipe datanya sudah tepat?
# Perhatikan df sebagaimana semua variable di Python diperlakukan seperti object
price.info()

<class 'pandas.core.frame.DataFrame'>
Index: 934 entries, 1 to 935
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Dist_Taxi      921 non-null    float64
 1   Dist_Market    921 non-null    float64
 2   Dist_Hospital  933 non-null    float64
 3   Carpet         926 non-null    float64
 4   Builtup        919 non-null    float64
 5   Parking        934 non-null    object
 6   City_Category  934 non-null    object
 7   Rainfall       934 non-null    int64
 8   House_Price    934 non-null    int64
 9   total_jarak    921 non-null    float64
 10  harga_jual     934 non-null    int64
dtypes: float64(6), int64(3), object(2)
memory usage: 87.6+ KB

In [ ]:
price.dtypes # less information, tapi perhatikan struktur datanya (more useful).

In [69]:
# dataframe types: https://pbpython.com/pandas_dtypes.html
price['Parking'] = price['Parking'].astype('category')
price['City_Category'] = price['City_Category'].astype('category')
price.dtypes

Dist_Taxi         float64
Dist_Market       float64
Dist_Hospital     float64
Carpet            float64
Builtup           float64
Parking          category
City_Category    category
Rainfall            int64
House_Price         int64
total_jarak       float64
harga_jual          int64
dtype: object

# <center><font color="blue"> Variable Type Selection</font></center>
### <font color="green"> Slicing data berdasarkan Tipe sangat penting, karena visualisasi atau algoritma tertentu hanya untuk suatu tipe data tertentu juga.</font>
    
<center><img alt="" src="images/pandas subsetting.png" style="height: 250px;" /></center>

In [ ]:
# Jika yang dibutuhkan memang hanya nama kolom, maka kita bisa melakukan hal ini untuk menghemat penggunaan memory
numVar = price.select_dtypes(include = ['float64', 'int64']).columns

numVar.to_list()

In [ ]:
# Memilih hanya variable dengan tipe tertentu
numVar = price.select_dtypes(include = ['float64', 'int64'])
numVar.head() # Perhatikan numVar adalah variable df baru! (hati-hati di data yang besar)

In [ ]:
# Memilih hanya variable dengan tipe tertentu
catVar = price.select_dtypes(include = ['object', 'category'])
catVar.head(3)

In [ ]:
# get all unique values of a variable/column
for col in catVar.columns:
    print(col,': ', set(price[col].unique()))

# <center><font color="blue"> Memilih variabel-variabel di data secara manual</font></center>

In [ ]:
# Choosing some columns manually
X = price[['House_Price','Dist_Market']] # perhatikan ada 2 tanda kurung siku "[[]]"
X.head(3)

In [ ]:
# Slicing DataFrame - Just like query in SQL
price[price["City_Category"] == "CAT B"].drop("City_Category", axis=1).head()

In [ ]:
# Slicing DataFrame - Just like query in SQL
X = price[price["Parking"].isin(["Open","Covered"])]
X = X[X["City_Category"] == "CAT B"].drop("City_Category", axis=1)
X.head()

# <center><font color="blue"> Import-Loading Data CSV / Excel Data via Pandas</font></center>

<img alt="" src="images/pandas load csv excel.png" style="height: 150px;" />

* Importing CSV file  https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
* Importing Excel file  https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html
* Encodings https://docs.python.org/3/library/codecs.html#standard-encodings

In [ ]:
import pandas as pd

In [ ]:
file_ = 'data/price.csv'
try: # Running Locally, yakinkan "file_" berada di folder "data"
    price = pd.read_csv(file_, low_memory = False, encoding='utf8')
except: # Running in Google Colab
    !mkdir data
    !wget -P data/ https://raw.githubusercontent.com/taudata-indonesia/eLearning/master/data/price.csv
    price = pd.read_csv(file_, low_memory = False, encoding='utf8')
    
N, P = price.shape # Ukuran Data
print('baris = ', N, ', Kolom (jumlah variabel) = ', P)
print("Tipe Variabe df = ", type(price))
price

# <center><font color="blue"> Bagaimana dengan File Excel?</font></center>
## <font color="green"> Karena deprecated support, maka harus install module "openpyxl" terlebih dahulu</font>

* Importing Excel file  https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html
* openpyxl https://openpyxl.readthedocs.io/en/stable/
<center><img alt="" src="images/meme-cartoon/openpyxl.jpg" style="height: 300px;" /></center>

In [ ]:
# Ingat module 02, jika anda menjalankan Jupyter notebook ini secara lokal, maka perlu penyesuaian
!pip install openpyxl

In [ ]:
file_ = 'data/price.xlsx'
try: # Running Locally 
    xl = pd.ExcelFile(file_, engine = 'openpyxl')
except: # Running in Google Colab
    !mkdir data
    !wget -P data/ https://raw.githubusercontent.com/taudata-indonesia/eLearning/master/{file_}
    xl = pd.ExcelFile(file_, engine = 'openpyxl')

sheets_ = xl.sheet_names
print(sheets_)
price = xl.parse(sheets_[0], header=0) #biasakan tidak menulis nama sheet secara langsung

N, P = price.shape # Ukuran Data
print('baris = ', N, ', Kolom (jumlah variabel) = ', P)
print("Tipe Variabe df = ", type(price))
price

# <center><font color="blue"> Import-Loading Data MySQL via Pandas</font></center>

<img alt="" src="images/Pandas_MySQL.png" style="height: 150px;" />

*  https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html

# <center><font color="blue">MySQL XAMPP</font></center>

<img alt="" src="images/xampp.png" style="height: 150px;" />

* https://www.apachefriends.org/download.html
* http://localhost/phpmyadmin/index.php   (setelah menjalankan PHP & MySQL dari XAMPP)
* https://taudata.blogspot.com/2020/04/dfds-01.html

# <center><font color="blue">Web API</font></center>

<img alt="" src="images/web_scraping.png" style="height: 150px;" />

* https://panda.readthedocs.io/en/latest/api_tutorial.html
* https://towardsdatascience.com/scraping-tabular-data-with-pandas-python-10cf2a133cbf

In [ ]:
url = 'https://en.wikipedia.org/wiki/The_World%27s_Billionaires'
df_list = pd.read_html(url) # Hati-hati ini List!
print(len(df_list))

In [ ]:
df_list[0]

In [ ]:
df = df_list[2]
df.head()

In [ ]:
# Memilih Tabel tertentu
pd.read_html(url, match='Number and combined net worth of billionaires by year')[0].head()

# Sneak Peek PyVisual

!pip install visualpython

!visualpy install

# End of Module

<hr />